app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "pictionary"], ["room_number", 1], ["created_at", "2019-09-22 18:50:02.666964"], ["updated_at", "2019-09-22 18:50:02.666964"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-09-23 02:17:02.530811"], ["id", 1]]