app/controllers/students_controller.rb

    def create
        @student = Student.create(params_student)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "erin"], ["last_name", "volcan"], ["created_at", "2019-09-22 18:05:39.493739"], ["updated_at", "2019-09-22 18:05:39.493739"]]

    def update
        @student.update(params_student)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "brian"], ["last_name", "magida"], ["updated_at", "2019-09-22 18:11:30.607204"], ["id", 1]]

    def find_student
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]